y9checklist.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-04-12 Tue 11:13 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Michael Charles" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline15">1. What do I need to have done by the end of this lesson?</a>
<ul>
<li><a href="#orgheadline6">1.1. <span class="todo TODO">TODO</span> Organised your folders -</a>
<ul>
<li><a href="#orgheadline1">1.1.1. Word</a></li>
<li><a href="#orgheadline2">1.1.2. Excel</a></li>
<li><a href="#orgheadline3">1.1.3. PowerPoint</a></li>
<li><a href="#orgheadline4">1.1.4. Programming</a></li>
<li><a href="#orgheadline5">1.1.5. Misc</a></li>
</ul>
</li>
<li><a href="#orgheadline10">1.2. <span class="todo TODO">TODO</span> Put a screenshot of your folders into your ICT Portfolio</a>
<ul>
<li><a href="#orgheadline7">1.2.1. <span class="todo TODO">TODO</span> Press 'Print Screen' on your keyboard to take a screenshot and copy it to the clipboard</a></li>
<li><a href="#orgheadline8">1.2.2. <span class="todo TODO">TODO</span> Paste your screenshot into slide 9 of your #ICT Portfolio</a></li>
<li><a href="#orgheadline9">1.2.3. <span class="todo TODO">TODO</span> Crop the image (under 'Format') to show only your folders.</a></li>
</ul>
</li>
<li><a href="#orgheadline14">1.3. <span class="todo TODO">TODO</span> Answer these questions on a PowerPoint slide:</a>
<ul>
<li><a href="#orgheadline11">1.3.1. 1. Why should you keep neat files and folders?</a></li>
<li><a href="#orgheadline12">1.3.2. 2. What could happen if your files and folders are not neat and do not have suitable names?</a></li>
<li><a href="#orgheadline13">1.3.3. 3. What is a possible reason why people struggle with keeping neat files and folders?</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-2">
<h2 id="orgheadline15"><span class="section-number-2">1</span> What do I need to have done by the end of this lesson?</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">1.1</span> <span class="todo TODO">TODO</span> Organised your folders -</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-orgheadline1" class="outline-4">
<h4 id="orgheadline1"><span class="section-number-4">1.1.1</span> Word</h4>
</div>
<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">1.1.2</span> Excel</h4>
</div>
<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="section-number-4">1.1.3</span> PowerPoint</h4>
</div>
<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">1.1.4</span> Programming</h4>
</div>
<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">1.1.5</span> Misc</h4>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">1.2</span> <span class="todo TODO">TODO</span> Put a screenshot of your folders into your ICT Portfolio</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7"><span class="section-number-4">1.2.1</span> <span class="todo TODO">TODO</span> Press 'Print Screen' on your keyboard to take a screenshot and copy it to the clipboard</h4>
</div>
<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><span class="section-number-4">1.2.2</span> <span class="todo TODO">TODO</span> Paste your screenshot into slide 9 of your #ICT Portfolio</h4>
</div>
<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">1.2.3</span> <span class="todo TODO">TODO</span> Crop the image (under 'Format') to show only your folders.</h4>
</div>
</div>
<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">1.3</span> <span class="todo TODO">TODO</span> Answer these questions on a PowerPoint slide:</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">1.3.1</span> 1. Why should you keep neat files and folders?</h4>
</div>
<div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12"><span class="section-number-4">1.3.2</span> 2. What could happen if your files and folders are not neat and do not have suitable names?</h4>
</div>
<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13"><span class="section-number-4">1.3.3</span> 3. What is a possible reason why people struggle with keeping neat files and folders?</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Michael Charles</p>
<p class="date">Created: 2016-04-12 Tue 11:13</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
